import React, { useState } from 'react'

function MovingDot() {
    const [positon, setPosition] = useState({ x: 0, y: 0 });

    // এখানে ৩টা জিনিস বুঝতে হবে:

// 🔹 position
//     position = { x: 0, y: 0 }


// 👉 dot - এর বর্তমান অবস্থান
// 👉 শুরুতে স্ক্রিনের(0, 0) পজিশনে

// 🔹 setPosition

// 👉 position পরিবর্তন করার ফাংশন
// 👉 এটা কল করলেই React আবার render করবে
    


return (
        <div>

            {/* 
            🔥 এখানে আসল ম্যাজিক
🔹 onPointerMove

👉 মাউস / টাচ / পেন নড়লেই এই function চলবে

🔹 e

👉 event object
👉 মাউস কোথায় আছে সেই তথ্য দেয়

🔹 e.clientX

👉 মাউসের X position (left থেকে কত px)

🔹 e.clientY

👉 মাউসের Y position (top থেকে কত px)

🔹 setPosition(...)

👉 মাউস নড়লেই নতুন position save হচ্ছে
👉 তাই dot মাউসের সাথে সাথে নড়ে
            
            
            */}
            onPointerMove={e => {
                setPosition({
                    x: e.clientX,
                    y:e.clientY
                });


            }}

            style={{
                positon: 'absolute',
                width: '100vw',
                height: '100vh'

 
// 🔹 position: relative
// 👉 ভেতরের absolute element (লাল dot) এই div-এর ভিতরে থাকবে

// 🔹 100vw / 100vh
// 👉 পুরো screen জুড়ে container
                
            }}
        </div>
    )
}

export default MovingDot
